:PROPERTIES:
:ID:       7be4c876-4b75-465c-a734-1445188eab96
:END:
#+title: NixOS

* Installation
** Initial Partition Prep
There needs to be at least three partitions:
| Name  | Size           | Filesystem | Flags    |
|-------+----------------+------------+----------|
| efi   | 1GiB           | fat32      | esp,boot |
| swap  | $available_ram | linux-swap |          |
| nixos | $unused_space  | xfs        |          |
* Channels
** Checking channels
#+begin_src shell :dir /sudo::
  nix-channel --list
#+end_src

#+RESULTS:
| home-manager | https://github.com/rycee/home-manager/archive/release-20.03.tar.gz |
| nixos        | https://nixos.org/channels/nixos-unstable                          |
** Upgrading to Unstable
Move to unstable channel:
#+begin_src bash
  nix-channel --add https://nixos.org/channels/nixos-unstable nixos
#+end_src

Rebuild with upgrade:
#+begin_src bash
  nixos-rebuild switch --upgrade
#+end_src

** Add nixpkgs or nixos fork as channel
#+begin_src text
  nix-channel --add https://github.com/LnL7/nixpkgs/archive/foo.tar.gz nixpkgs-foo
#+end_src

*
* Store
** Get Hash of Store Path
#+begin_src sh
  nix-hash --type sha256 --base32 /nix/store/xxx
#+end_src
** Find Dependants Of Package
#+begin_src bash
nix-store --query --roots /nix/store/7dnsvya7hz0srvh4wrkyi6q2w36lgkf9-styx-0.7.1-lib
#+end_src

also nix-whydepends
* Nix-env
** Install Derivation With nix-env
#+begin_src sh
  nix-env -f default.nix -i
#+end_src
* Audio
** Jack
https://github.com/NixOS/nixpkgs/pull/93431#issuecomment-680828528
* Resources
+ https://search.nix.gsc.io/
+ https://weekly.nixos.org/
+ https://nix.dev/
  Opinionated guide on development on NixOS
